app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def new
  	@book = Book.new
    @books = Book.all

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "yy"], ["body", "yy"], ["created_at", "2017-11-22 12:17:32.404706"], ["updated_at", "2017-11-22 12:17:32.404706"], ["user_id", 1]]
---
  def create
  	book = Book.new(book_params)
    book.user_id = current_user.id
  	book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "attttt"], ["body", "gggga"], ["updated_at", "2017-11-15 12:17:36.802460"], ["id", 1]]
---
  def update
  	book = Book.find(params[:id])
    book.update(book_params)