app/controllers/users_controller.rb

  def update
  	user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "aaaa"], ["image_id", "b9d9d182547983ce7b6fb89ddaac7a7fb778d70eb0386c9c8511ddb3a2c8"], ["updated_at", "2017-11-26 12:47:32.628282"], ["id", 3]]